package com.example.breast_app;

import androidx.appcompat.app.AppCompatActivity;

import android.graphics.drawable.Drawable;
import android.os.Bundle;
import android.widget.ImageView;
import android.widget.TextView;

public class ArticleDisplay extends AppCompatActivity {

    String s1 = "سرطان الثدي (Breast Cancer) هو مرض يصيب النساء بالتحديد، لكنه قد يصيب الرجال أيضا، وإن كان بنسبة أقل بكثير.\n" +
            "توصل الأطباء مؤخراً إلى إنجازات كبيرة في مجاليّ الكشف المبكر والعلاج لمرض سرطان الثدي لينخفض عدد الوفيات الناجمة عن المرض.\n" +
            "كان الكشف عن سرطان الثدي سابقاً يعني استئصال الثدي بالكامل، أما اليوم، فإن هذه العمليات لا تُجرى إلا في حالات نادرة، إذ يوجد مجموعة واسعة من العلاجات المتوفرة.\n";
    String s2 = "\n" +
            "الوعي واليقظة للأعراض والعلامات المبكرة من سرطان الثدي يمكن أن ينقذا حياتك.\n" +
            "فحين يتم الكشف عن المرض في مراحله الأولية المبكرة، تكون تشكيلة العلاجات المتاحة أوسع وأكثر تنوعا، كما تكون فرص الشفاء التام كبيرة جدا.\n" +
            "معظم الكتل التي يتم اكتشافها في الثدي ليست خبيثة، ومع ذلك فإن العلامة المبكرة الأكثر شيوعاً للإصابة بمرض سرطان الثدي لدى النساء والرجال على حد سواء، هي ظهور كتلة أو تكثـّف في نسيج الثدي، هذه الكتلة غير مؤلمة، غالبا.\n" +
            "تشمل أعراض سرطان الثدي ما يلي:\n" +
            "•\tإفراز مادة شفافة أو مشابهة للدم من الحلمة، يظهر، أحيانا، مع ظهور الورم في الثدي\n" +
            "•\tتراجع الحلمة أو تسننها\n" +
            "•\t تغيّر حجم أو ملامح الثدي\n" +
            "•\t تسطـّح أو تسنن الجلد الذي يغطي الثّدي\n" +
            "•\t ظهور احمرار أو ما يشبه الجلد المجعّد على سطح الثدي، مثل قشرة البرتقال.\n";
    String s3 = "\n" +
            "سرطان الثدي يعني أن عددا من خلايا الثدي بدأت تتكاثر بشكل غير طبيعي. هذه الخلايا تنقسم بسرعة أكبر من الخلايا السليمة ويمكن أن تبدأ في الانتشار (نقيلات - Metastasis) في جميع أنحاء نسيج الثدي، إلى داخل الغدد الليمفاوية، بل وإلى أعضاء أخرى في الجسم.\n" +
            "النوع الأكثر شيوعا من سرطان الثدي يبدأ في غدد إنتاج الحليب، ولكن من الممكن أن يبدأ أيضا في أحد الفصوص (Lobe) الفرعية أو في غيرها من أنسجة الثدي.\n" +
            "في معظم الحالات، ليس واضحا السبب الذي يجعل خلايا سليمة في نسيج الثدي تتحول إلى خلايا سرطانية.\n" +
            "أسباب الإصابة بسرطان الثدي\n" +
            "يعرف الأطباء أسباب الإصابة بالمرض على الشكل التالي:\n" +
            "•\tالوراثة: 5% - 10% فقط من حالات سرطان الثدي تعود إلى أسباب وراثية. هنالك عائلات لديها خلل في جين (جينة / مورِثَة  - Gene) واحد أو اثنين، جين سرطان الثدي رقم 1 (BRCA 1) أو جين سرطان الثدي رقم 2 (BRCA 2)، وهذا يكون احتمال تعرض أبنائها وبناتها للإصابة بمرض سرطان الثدي أو بسرطان المبيض مرتفعا جدا.\n" +
            "•\tعيوب (خِلل) جينية أخرى: مثل جين رنح توسع الشعيرات (ataxia - telangiectasia mutation gene)، جين كيناز - حاجز دورة الخلية 2 (CHEK - 2) وجين رقم P53، الجين المسؤول عن لجم الأورام - كلها تزيد من خطر الإصابة بمرض سرطان الثدي. إذا كان أحد هذه العيوب الوراثية موجودا في عائلتك، فهنالك احتمال بنسبة 50 ٪ أن يكون الخلل موجودا عندك أنت أيضا.\n" +
            "معظم العيوب الجينية ذات الصلة بمرض سرطان الثدي لا تنتقل بالوراثة.\n" +
            "قد يعود سبب هذه العيوب المكتَسَبة إلى التعرض للأشعة - النساء اللواتي عولجن بالإشعاعات في منطقة الصدر لمعالجة ورم لِمْفيّ (لِمفومَة - Lymphoma) في مرحلة الطفولة أو المراهقة، مرحلة نمو الثدي وتطوره، أكثر عرضة بكثير جدا للإصابة بمرض سرطان الثدي من النساء اللواتي لم يتعرضن لإشعاع من هذا القبيل.\n" +
            "قد تطرأ التغيّرات الجينية، أيضا، جراء التعرض لمواد مسببة للسرطان، مثل بعض الهيدروكربونيات، الموجودة في التبغ واللحوم الحمراء المتفحمة.\n" +
            "يحاول الباحثون اليوم معرفة ما إذا كانت هناك أية علاقة بين التركيبة الجينية لشخص معين وبين العوامل البيئية التي قد تزيد من خطر الإصابة بمرض سرطان الثدي. وربما يثبت أن عوامل عديدة قد تسبب ظهور سرطان الثدي.\n" +
            "عوامل الخطر\n" +
            "عامل الخطر هو أي شيء يزيد من احتمالات الإصابة بمرض معين. بعض عوامل الخطر، مثل السنّ، الجنس والتاريخ العائلي، لا يمكن تغييرها، بينما يستطيع الإنسان السيطرة على عوامل أخرى، مثل التدخين أو سوء التغذية.\n" +
            "لكن، حتى لو كان لديك عامل خطر واحد أو أكثر فهذا لا يعني بالضرورة أن تصابي بمرض سرطان الثدي، إذ إن غالبية النساء المريضات بمرض سرطان الثدي أصبن فقط لمجرد كونهن نساء وليس لديهن أية عوامل خطر أخرى إضافية.\n" +
            "والحقيقة، إن كونك امرأة هو عامل الخطر الأهمّ لسرطان الثدي. فعلى الرغم من أن الرجال أيضا معرضون للإصابة بمرض سرطان الثدي، إلا إنه أكثر شيوعا بكثير بين النساء.\n" +
            "عوامل خطر أخرى يمكن أن تزيد من خطر الإصابة بسرطان الثدي:\n" +
            "•\tالسنّ\n" +
            "•\tتاريخ شخصي من التعرض لسرطان الثدي\n" +
            "•\tتاريخ عائلي\n" +
            "•\tالميل الوراثي\n" +
            "•\tالتعرض لإشعاعات\n" +
            "•\tالوزن الزائد\n" +
            "•\tالحيض في سن مبكرة نسبيا\n" +
            "•\tالوصول إلى سن الإياس (انقطاع الطمث – سن \"اليأس\") في سن متأخرة نسبيا\n" +
            "•\tالعلاج بالهورمونات\n" +
            "•\tتناول أقراص منع الحمل\n" +
            "•\tالتدخين\n" +
            "•\tتغيّرات ما قبل سرطانية في نسيج الثدي\n" +
            "•\tكثافة عالية في نسيج الثدي بالتصوير الشعاعي (Mammography).\n" +
            "السنّ والفترة المحددة من مرحلة انقطاع الطمث قد تؤثران على كثافة نسيج الثدي. كثافة نسيج الثدي لدى الشابات، عادة، أعلى منها لدى النساء المتقدمات في السن.\n" +
            "للهورمونات أيضا تأثير على هذا -  كلما كانت مستويات الهورمونات أعلى، كلما كانت كثافة نسيج الثدي أعلى. وبالرغم من هذا، فإن خطر الإصابة بمرض سرطان الثدي بسبب الكثافة العالية في نسيج الثدي يزداد بنسبة ضئيلة فقط.\n" +
            "إذا كنت ضمن واحدة من المجموعات الأكثر عرضة للإصابة بسرطان الثدي، وكثافة نسيج الثدي لديك مرتفعة، فقد يكون من الصعب تحليل التصوير الشعاعي (Mammography)، وعندها قد ينصحك طبيبك بإجراء فحوصات مسحيّة أخرى.\n" +
            "اسباب ظهور أورامًا ليست خبيثة في الثدي\n" +
            "ثمة حالات طبية أخرى، غير سرطان الثدي، يمكن أن تؤدي إلى تغيّر في حجم الثدي أو في نسيجه. فنسيج الثدي يتغير، بطبيعة الحال، خلال فترة الحمل وخلال فترة الحيض.\n" +
            "أما الأسباب الأخرى المحتملة لظهور أورام ليست سرطانية (حميدة) في الثدي فتشمل:\n" +
            "•\tتغيّرات كيسيّة ليفيّة (fibrocystic changes)\n" +
            "•\tتكيّس (ظهور كيسات – Cyst)\n" +
            "•\tورم غُدّي ليفيّ (fibroadenoma)\n" +
            "•\tتلوّث أو إصابة\n";
    String s4 = "\n" +
            "اذا لاحظتِ وجود كتلة أو تغيّر، أيا كان، في ثديك - حتى لو كانت نتيجة التصوير الشعاعي الأخير للثدي (ماموغرافيا - Mammography) سليمة - عليك الاتصال بالطبيب لتقييم الوضع.\n" +
            "إذا لم تتجاوزي، بعد، سن الإياس (انقطاع الطمث / سن \"اليأس\" – Menopause) فقد يكون من الأفضل الانتظار لمدة دورة حيض واحدة قبل مراجعة طبيبك. ولكن، إذا لم تختف التغيّرات في الثدي بعد شهر، فمن الضروري التوجه إلى الطبيب لتقييم الوضع.\n" +
            "التفريسات (Scans) - البحث عن أدلة لوجود سرطان الثدي قبل ظهور الأعراض الأولى - هي المفتاح للكشف المبكر عن سرطان الثدي، حين لا يزال في مرحلة يمكن فيها معالجته.\n" +
            "طبقا للمعلومات عن سنّك ومجموعة (أو مجموعات) الخطر التي قد ينتمين إليها، تشمل التفريسات: إجراء فحص ذاتيّ للثدي، فحص الثدي من قبل ممرضة أو طبيب (الفحص في العيادة)، تصوير الثدي الشعاعي (Mammography)، أو فحوصات أخرى غيرها.\n" +
            "فحص ذاتي للثدي\n" +
            "الفحص الذاتي للثدي هو إحدى الإمكانيات، فقط، ويجب إجراؤه بشكل دائم ومنتظم بدءا من سن 20 عاما. إن اكتسابك خبرة الفحص الذاتي للثدي، وتعرفك على أنسجة وبنية ثديك على أساس دائم ومنتظم، قد يجعلانك قادرة على كشف علامات مبكرة لسرطان الثدي.\n" +
            "يجب عليك أن تتعلمي كيف يبدو ثديك عادة، وأن تكوني يقظة لأي تغيير في الإحساس أو في نسيج الثدي. فإذا ما لاحظت أية تغيّرات، يجب إعلام الطبيب في أسرع وقت ممكن. أتيحي لطبيبك اختبار كيفية قيامك بالفحص الذاتي، كي يستطيع إرشادك والإجابة على ما قد تثيرينه من تساؤلات.\n" +
            "فحص الثدي في العيادة\n" +
            " إذا كان لديك في العائلة من أصيب بمرض سرطان الثدي (تاريخ عائلي) أو إذا كنت تنتمين لإحدى مجموعات الخطر الأكثر عرضة للإصابة بسرطان الثدي، فيُنصح بأن تخضعي لفحص الثدي في العيادة مرة واحدة كل ثلاث سنوات حتى بلوغك سن الـ 40 عاما. ثم بمعدل مرة واحدة كل سنة، فيما بعد.\n" +
            "خلال هذا الفحص يقوم الطبيب بتفقد نسيج الثدي للبحث عن كتل أو تغيُّرات أخرى في الثدي. يستطيع الطبيب كشف الكتل أو التغييرات التي لم تفلحي أنت في الانتباه إليها، ويمكن أن يلاحظ أيضا ازدياد حجم الغدد الليمفاوية الموجودة في منطقة الإبط.\n" +
            "تصوير الثدي الشّعاعي (Mammography)\n" +
            "تصوير الثدي الشعاعي، الذي يفحص أنسجة الثدي من خلال إنتاج صور الأشعة السينية (أشعة رنتجن - X - Ray)، يعتبر اليوم الفحص الأكثر موثوقية للكشف المبكر عن كتل سرطانية في الثدي، حتى قبل إن يشعر الطبيب بها بواسطة اللمس اليدوي للثدي. ولهذا السبب، يُنصح  إجراء هذا الفحص لكل النساء فوق سن الـ 40 عاما، بشكل متكرر.\n" +
            "هنالك نوعان من تصوير الثدي الشعاعي:\n" +
            "1.\tالتفرّس بالتصوير الشعاعي للثدي (Scanning Mammography)\n" +
            "2.\tالتصوير الشعاعي التشخيصي للثدي (Diagnostic Mammography)\n" +
            "لكن فحوصات التصوير الشعاعي ليست مثالية. فهناك نسبة معينة من الأورام السرطانية – واحيانا كتل يمكن تحسسها بالفحص الذاتي – لا تظهر في صورة الأشعة السينية (جواب سلبي خاطئ).\n" +
            "هذه النسبة تكون أعلى بين النساء اللواتي هن في الأربعينات من العمر، وذلك لأن النساء في هذا العمر والنساء الأصغر سنا هن أكثر ميلا لوجود كثافة أعلى في نسيج الثدي، مما يجعل من الصعب التمييز بين نسيج سليم وآخر غير سليم.\n" +
            "فحوص أخرى:\n" +
            "1.\tالكشف بمساعدة الحاسوب (CAD)\n" +
            "2.\tتصوير الثدي الشعاعي الرقميّ.\n" +
            "3.\tالتصوير بالرنين المغناطيسي (MRI)\n" +
            " إجراءات تشخيصية\n" +
            "خلافا لفحوصات التفرّس (Scaning)، فإن إجراءات التشخيص تساعد في تحديد وتوصيف الحالات الشاذة في نسيج الثدي التي تم الكشف عنها بالفحوصات الروتينية، مثل اكتشاف كتلة في الثدي باللمس، أو بواسطة التفرّس بالتصوير الشعاعي للثدي أو بالتصوير بالرنين المغناطيسي (MRI).\n" +
            "هذه الفحوصات تساعد الطبيب في تحديد ما إذا كنتِ بحاجة إلى إجراء خزْعة (إجراء طبي تؤخذ فيه خلايا أو نسيج كعيّنة للتحليل والفحص في المختبر - Biopsy)، كما تساعد في بلورة توجيهات لكيفية إجراء الاختزاع (فحص الخزعة).\n" +
            "فحص بالموجات فوق الصوتية (Ultrasound)\n" +
            "يستخدم هذا الفحص للتأكد من أن الكتل التي تم كشفها في الثدي صلبة أم لا.\n" +
            "الخزْعَة (Biopsy)\n" +
            "هو الفحص الوحيد القادر على تأكيد وجود خلايا سرطانية. الخزعة فحص يستطيع تزويدنا بمعلومات حيوية جدا عن أية تغيرات شاذة أو غير طبيعية في نسيج الثدي، والمساعدة في تحديد مدى الحاجة (وجودها أو عدمه) إلى إجراء عملية جراحية وبشأن نوع العملية الجراحية المطلوبة. \n" +
            "أنواع الاختزاعات القائمة اليوم:\n" +
            "1.\tاختزاع بالإبرة النحيفة (Fine needle)\n" +
            "2.\tاختزاع بالإبرة الثخينة (Coreneedle)\n" +
            "3.\tاختزاع تجسيميّ (Stereotactic biopsy)\n" +
            "4.\tموضعة سلك معدني\n" +
            "5.\tاختزاع جراحيّ\n" +
            "فحص مستقبلات الأستروجين والبروجسترون (Biopsy)\n" +
            "يمكن فحص وجود المستقبلات الهورمونية في الخلايا السرطانية التي تم نزعها خلال الخزعة. إذا وجدت مستقبلات الاستروجين أو مستقبلات البروجسترون أو كليهما معا، فإن ينصحك طبيبك بتناول أدوية، مثل تاموكسيفين (Tamoxifen)، تمنع الاستروجين من الوصول إلى هذه المناطق.\n" +
            "فحص التدريج\n" +
            "فحوصات لتدريج خطورة المرض، يتم من خلالها تحديد حجم وموقع الورم السرطاني وما إذا كان الورم قد انتقل وانتشر في أماكن أخرى. والتدرج يساعد أيضا في تخطيط الإجراءات العلاجية.\n" +
            "فحوصات وراثية أو جينيّة\n" +
            "اذا وجدت في العائلة حالة وراثية أو أكثر، من سرطان الثدي، فستساعد فحوص الدم في اكتشاف جين BRCA المَعيب أو عيوبا في جينات أخرى تنتقل من جيل إلى آخر في العائلة.\n" +
            "هذه الفحوصات غالبا ما تسفر عن نتائج غير حاسمة ولذلك يجب تنفيذها في حالات خاصة فقط، وبعد التشاور مع مستشار للأمراض الوراثية. إذا لم تكوني ضمن مجموعات الخطر للإصابة بمرض سرطان الثدي أو سرطان المبيض على خلفية وراثية، فلا داعي، إجمالا، لإجراء فحوص التشخيص الوراثية.\n" +
            "التشخيص الوراثي يمكن أن يكون مفيدا، في معظم الحالات، فقط إذا كانت نتائج الفحص ستساعدك على اختيار الطريقة الأفضل لتقليص خطر الإصابة بالسرطان.\n" +
            "الخيارات تتراوح ما بين إجراء تغييرات في نمط  حياتك، إجراء مسوحات وفحوصات تفرّس (Scanning) سوية مع تناول أدوية مثل تاموكسيفين (Tamoxifen)، وحتى اتخاذ تدابير متطرفة مثل استئصال كلا الثديين معا، كإجراء وقائيّ وإزالة المبيضين.\n" +
            "تصنيف الورم السرطاني\n" +
            "يتم تصنيف الورم السرطاني على جدول من 0 إلى IV (أربعة)، على النحو التالي:\n" +
            "•\tالدرجة 0: تسمى أيضا \"سرطان ثدي غير غازٍ\"، أو محلي. وعلى الرغم من أن هذه الأورام لا تملك القدرة على غزو الأنسجة السليمة في الثدي أو الانتشار إلى أعضاء أخرى في الجسم، إلا إنه من المهم استئصالها وإزالتها، لأنها قد تتحول إلى أورام غازية في المستقبل.\n" +
            "•\tالدرجات من I حتى IV: هي أورام غازية لديها القدرة على غزو أنسجة سليمة في الثدي، ثم الانتشار إلى أعضاء أخرى في الجسم. الورم السرطاني في الدرجة I هو ورم صغير ومحلي، فرص الشفاء التام منه كبيرة جدا. لكن، كلما ارتفعت الدرجة قلّت فرص الشفاء.\n" +
            "•\tالدرجة IV: هو ورم سرطانيّ انتقل إلى خارج نسيج الثدي وانتشر في أعضاء أخرى من الجسم، مثل الرئتين والعظام والكبد. وعلى الرغم من أنه لا يمكن الشفاء من السرطان في هذه المرحلة، إلا إن هناك احتمالا بأن يستجيب بطريقة جيدة لعلاجات متنوعة، من شأنها أن تسبب انكماش وتضاؤل الورم وإبقاءه تحت السيطرة لفترة طويلة من الزمن.\n";
    String s5 = "\n" +
            "إن إبلاغك بأنه قد تم تشخيص إصابتك بمرض سرطان الثدي هو من التجارب الأكثر صعوبة التي يمكن للإنسان أن يواجهها. فبالإضافة إلى مواجهة مرض يشكل خطرا حياتيا، عليك اتخاذ قرارات بشأن برنامج علاجي غير سهل، على الإطلاق.\n" +
            "يفضّل التشاور مع الفريق الطبي حول خيارات علاج سرطان الثدي المتاحة. ويفضّل الحصول على رأي ثان من أخصائي في مرض سرطان الثدي. كما انه من المفيد التحدث مع نساء تعرضن لتجربة مماثلة.\n" +
            "تتوفر اليوم تشكيلة منوعة من العلاجات لكل مرحلة من مراحل المرض. غالبية النساء تخضع لعمليات جراحية لاستئصال الثدي، بالإضافة إلى العلاج الكيماوي، الإشعاعي أو العلاج الهورموني. كما إن هناك أيضا مجموعة متنوعة من العلاجات التجريبية لهذا النوع من السرطان.\n" +
            "1- الجراحة\n" +
            "استئصال الثدي كلّه أصبح إجراء نادرا اليوم. بدلا من ذلك، معظم النساء مرشحات ممتازات لاستئصال جزئي (الجزء المصاب من الثدي) أو لاستئصال الورم فقط.\n" +
            "إذا قررت استئصال الثدي كليا، فقد تفكرين لاحقا في عملية لإعادة بناء الثدي من جديد.\n" +
            "العمليات الجراحية لإزالة أورام سرطانية في الثدي تشمل:\n" +
            "استئصال الورم السرطاني\n" +
            " العمليات الجراحية لاستئصال الورم السرطاني تتبعها، دائما، علاجات بالإشعاعات، وذلك من أجل تدمير أية خلايا سرطانية يمكن أن تكون قد بقيت في المكان.\n" +
            "ولكن، إذا كان الورم صغيرا وليس من النوع الغازي المنتشر، فإن بعض الدراسات تتساءل عن ضرورة العلاج الإشعاعي، وخاصة عندما يتعلق الأمر بالسيدات المتقدمات في السن.\n" +
            "ولم تنجح هذه الدراسات في أن تثبت، بشكل قاطع، ما إذا كان استئصال الورم متبوعا بالعلاج الإشعاعي يسهم، بالتأكيد، في تمديد وتحسين حياة المريضات، مقارنة مع اللواتي خضعن لاستئصال الورم فقط.\n" +
            " أنواع جراحات استئصال الثدي\n" +
            "•\tالاستئصال الجزئي أو المقطعيّ من الثدي\n" +
            "•\tالاستئصال البسيط\n" +
            "•\tالاستئصال الكلّيّ للثدي.\n" +
            "خزعة من الغدد الحارسة (Sentinel lymph node biopsy)\n" +
            " بما إن سرطان الثدي ينتشر، في المقام الأول، باتجاه الغدد الليمفاوية الموجودة تحت الإبط (الغدد الليمفوية الحارسة أو الخافرة - Sentinel lymph node)، فإنه يتوجب على جميع النساء اللواتي تم تشخيص إصابتهن بسرطان من النوع الغازي أن يخضعن لفحص هذه الغدد.\n" +
            "استئصال الغدد الليمفاوية الإبطية\n" +
            " إذا كانت هنالك علامات على وجود ورم سرطاني في الغدد الحارسة، فعلى الطبيب الجَرّاح استئصال كل الغدد الليمفاوية تحت الإبط.\n" +
            "جراحة لإعادة بناء (ترميم) الثدي\n" +
            "إذا كنت ترغبين في الخضوع لعملية جراحية لإعادة بناء (ترميم) الثدي من جديد، تحدثي مع الطبيب الجرّاح قبل إجراء أية عملية جراحية.\n" +
            "ليست كل النساء ملائمات لجراحة إعادة بناء الثدي. ويمكن لجراح التجميل تقديم النصح حول مجموعة متنوعة من العمليات، عرض صور فوتوغرافية لنساء خضعن لإجراءات مختلفة هدفها إعادة بناء الثدي، ويمكنك أن تتشاوري معه لاختيار نوع العملية الأكثر ملاءمة لك ولحالتك.\n" +
            "الخيارات المتاحة أمامك قد تشمل إعادة البناء بواسطة زرع نسيج اصطناعي أو زرع من أنسجتك أنت. ويمكن تنفيذ هذه العمليات الجراحية خلال عملية استئصال الثدي أو في وقت لاحق.\n" +
            "أنواع إعادة بناء (ترميم) الثدي تشمل:\n" +
            "•\tبواسطة زرع نسيج اصطناعي\n" +
            "•\tبواسطة طية أنسجة شخصية\n" +
            "•\tالثاقوب الشرسوفي السفلي العميق (Deep inferior epigastric perforator - DIEP)\n" +
            "•\tإعادة بناء منطقة الحلمة وهالة الثدي.\n" +
            "2- علاجات بالأشعّة / معالجات إشعاعية (Radiation therapy)\n" +
            "العديد من الأشخاص الذين يعانون من السرطان يتعالجون اليوم بالإشعاع، بعضهم يقتصر علاجهم عليه فقط بينما يذهب الأطباء عند البعض الاخر بدمجه مع علاجات أخرى كالعلاج الكيميائي.\n" +
            "الهدف الأساسي من العلاج الإشعاعي هو تقليص حجم الأورام وقتل الخلايا السرطانية، وفي حين أن الأشعة قد تستهدف الخلايا السليمة أيضا إلا أنه ليس من الضروري أن تصاب بالضرر الذي يلحق الخلايا السرطانية، حيث أن الخلايا السليمة تتمتع بقدرة على إنعاش نفسها.\n" +
            "3- المعالجة الكيميائية (Chemotherapy)\n" +
            "فعالية العلاج الكيميائي في القضاء على الأورام الخبيثة قد تفوق الجراحة والإشعاع معاً، وذلك لقدرة العلاج الكيميائي على الوصول لكافة أجزاء الجسم، وليس فقط  لأماكن محددة فقط كما في الجراحة أو الإشعاع.\n" +
            "في بعض الأحيان يحصل مريض السرطان على جرعات من العلاج الكيميائي بهدف تقليص حجم الورم لديه قبل إجراء عملية جراحية لاستئصاله أو قبل البدء في جلسات العلاج بالإشعاع. \n" +
            "العلاج الكيميائي يستهدف جينات ومواد بروتينية خاصة في الخلايا السرطانية يدمرها ويمنع نمو أورام جديدة. وكذلك يمنع وصول الغذاء إليها من الأوعية الدموية. \n" +
            "4- العلاج بالهورمونات\n" +
            "في حالة الاصابة بسرطان من النوع الحساس للهرمونات، فقد يتم تقديم العلاج بحصر الهرمون عن طريق الأدوية، مثل تاموكسيفين أو مثبطات أروماتاز.\n" +
            "يعمل هذا العلاج على وقف إفراز هرمون الأستروجين.\n" +
            "5- العلاج البيولوجي\n" +
            "مع اكتساب العلماء والباحثين المزيد من المعرفة بشأن الفوارق بين الخلايا السليمة والخلايا السرطانية، يتم تطوير علاجات تستهدف معالجة هذه الفوارق - العلاج على أساس بيولوجي.\n" +
            "هنالك ثلاثة أنواع من العلاجات البيولوجية المتاحة لمعالجة سرطان الثدي. وتشمل:\n" +
            "1.\tتراستوزوماب Trastuzumab (هيرسيبتين - Herceptin)\n" +
            "2.\t بيفاسيزوماب Bevacizumab (أفاستين - Avastin)\n" +
            "3.\tدوكيتاكسيل (Docetaxel)\n";
    String s6 = "\n" +
            "لا شيء يمكنه أن يضمن عدم الإصابة سرطان الثدي، ولكن هناك العديد من الخطوات التي يمكن اتخاذها للحد من خطر الإصابة بسرطان الثدي.\n" +
            "1- الوقاية بوسائل كيماوية\n" +
            "الوقاية بوسائل كيماوية تعني استخدام أدوية لتقليص مخاطر الإصابة بمرض سرطان الثدي.\n" +
            "هنالك نوعان من الأدوية المستخدمة لمنع سرطان الثدي عند النساء اللواتي هن أكثر عرضة من غيرهن للإصابة بمرض سرطان الثدي.\n" +
            "هذه الأدوية تنتمي إلى فئة من العقاقير التي تشغل مستقبلات هورمون الاستروجين بشكل انتقائي: (selective estrogen receptor modulators - SERM)\n" +
            "1.\tثاموكسيفين (Tamoxifen)\n" +
            "2.\tرالوكسيفين (Raloxifene)\n" +
            "2- الجراحة كإجراء وقائيّ\n" +
            "على الرغم من كون الجراحة إجراء مبالغ فيه، إلا إن العملية الجراحية كإجراء وقائي يمكنها الحدّ من خطر الإصابة بمرض سرطان الثدي لدى النساء الأكثر عرضة للإصابة بالمرض.\n" +
            "الخيارات تشمل:\n" +
            "1.\tاستئصال الثدي كإجراء وقائيّ\n" +
            "2.\tاستئصال مبيض كإجراء وقائيّ.\n" +
            "3- تغييرات في نمط الحياة\n" +
            "اتخاذ بعض الخطوات لتغيير نمط حياتك يمكن أن يكون عاملا مؤثرا في تقليل مخاطر إصابتك بمرض سرطان الثدي.\n" +
            "•\tإسألي طبيبك عمّا يتعلق تناول الأسبرين\n" +
            "•\tتجنب تناول الكحول\n" +
            "•\tالمحافظة على وزن سليم\n" +
            "•\tتجنب العلاجات الهورمونية الطويلة الأمد\n" +
            "•\tممارسة النشاط البدني الرياضي بانتظام\n" +
            "•\tتناول أطعمة غنية بالألياف الغذائية\n" +
            "•\tالإكثار من استهلاك زيت الزيتون\n" +
            "•\tتجنب التعرض لمبيدات الحشرات.\n" +
            "علاجات وقائية ممكنة\n" +
            "يواصل العلماء البحث في مسعى لتطوير علاجات وقائية ممكنة لمنع سرطان الثدي، بما في ذلك:\n" +
            "•\tحمض الريتينويك الرتينوئيدات (Retinoids) \n" +
            "•\tبذور الكتان.\n";
    String[] articals = {s1, s2, s3, s4, s5, s6};
    String[] headers = {"ما هو سرطان الثدي", "أعراض سرطان الثدي", "أسباب وعوامل خطر سرطان الثدي"
            , "تشخيص سرطان الثدي", "علاج سرطان الثدي", "الوقاية من سرطان الثدي"};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_article_display);

        TextView header = findViewById(R.id.header);
        TextView article = findViewById(R.id.article);
        ImageView image = findViewById(R.id.imageView);

        Drawable[] images = {
                getDrawable(R.drawable.what), getDrawable(R.drawable.appears)
                , getDrawable(R.drawable.reasons), getDrawable(R.drawable.examination)
                , getDrawable(R.drawable.treatment), getDrawable(R.drawable.save)
        };

        header.setText(headers[getIntent().getIntExtra("position",0)]);
        article.setText(articals[getIntent().getIntExtra("position",0)]);
        image.setImageDrawable(images[getIntent().getIntExtra("position",0)]);
    }
}
